const memeStreamsData = [
  {
    category: "Веселье",
    image: "https://i.pinimg.com/736x/d5/dd/0e/d5dd0ec561b15df21e0bca9039607d68.jpg",
    description: "Место для хорошего контента, который понравится всем! Юмор, мемы, гифки и котята — все здесь приветствуется. Репосты и политика не приветствуются.",
    members: 12221,
    comments: [
      { user: "MemeLover", text: "Эта категория всегда поднимает настроение!" },
      { user: "LaughMaster", text: "Без котиков мемы не мемы 😆" },
    ],
  },
  {
    category: "Группа_участников_MS",
    image: "https://i.pinimg.com/736x/0c/ac/ae/0cacaea872402c82cd85ff7ba2ba0525.jpg",
    description: "Добро пожаловать в MS_memer_group. Получите докторскую степень по шитпостингу в свободное время!",
    members: 9991,
    comments: [
      { user: "ShitpostKing", text: "Здесь можно встретить настоящие шедевры!" },
      { user: "DarkJoker", text: "Лучший контент для настоящих ценителей мемов." },
    ],
  },
  {
    category: "Игровой",
    image: "https://i.pinimg.com/736x/d0/00/fb/d000fb29aa999d3b97aeb648a88d8014.jpg",
    description: "Обсуждение цифровых игр: ПК, Mac, консоли, iOS, Android... все, что имеет процессор, на котором можно запускать игры!",
    members: 9404,
    comments: [
      { user: "PixelMage", text: "Геймерские мемы — это отдельное искусство!" },
      { user: "CyberKnight", text: "Люблю мемы про баги и смешные игровые моменты." },
    ],
  },
  {
    category: "МЕМЫ_ПЕРЕЗАГРУЗКА",
    image: "https://i.pinimg.com/736x/0e/99/0c/0e990c53d578cbe751373ee9519a5e9a.jpg",
    description: "Привет, добро пожаловать на MEMES_OVERLOAD! Мы все здесь, чтобы веселиться, так что обязательно следуйте правилам и продолжайте мемить.",
    members: 5089,
    comments: [
      { user: "MemeGod", text: "Лучшее место для ежедневной дозы юмора!" },
      { user: "OverloadChampion", text: "Здесь всегда можно найти что-то вирусное." },
    ],
  },
  {
    category: "Политика",
    image: "https://i.pinimg.com/736x/7c/32/ca/7c32cac8224e024cee1c684ba9fa0035.jpg",
    description: "Юмор и обсуждение политики США и мира. Критика и дебаты приветствуются, но будьте конструктивны и никого не оскорбляйте.",
    members: 11539,
    comments: [
      { user: "DebateMaster", text: "Политические мемы — лучший способ обсудить новости." },
      { user: "IronyKing", text: "Когда мем отражает реальность лучше, чем новости 😆" },
    ],
  },
  {
    category: "Черный_юмор",
    image: "https://i.pinimg.com/736x/6a/76/f5/6a76f58dda8b5938b402dd146138b841.jpg",
    description: "Добро пожаловать в Dark_humour, главное сообщество для оскорбительного юмора.",
    members: 11539,
    comments: [
      { user: "RiskyJoke", text: "Люблю мемы, которые тестируют границы юмора!" },
      { user: "SavagePoster", text: "Если шутка не рискованная, это не шутка!" },
    ],
  },
];

export default memeStreamsData;
